vmux0.0.10-pre/ycsbVMs_ycsb_16vms_bridge-vhost_-1rps_rep1/vm6.log
/nix/store/2vwkssqpzykk37r996cafq7x63imf4sp-openjdk-21+35/bin/java  -classpath /nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/conf:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/core-0.17.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/HdrHistogram-2.1.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/htrace-core4-4.1.0-incubating.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-core-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-mapper-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/commons-pool2-2.4.2.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/jedis-2.9.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6379 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
Command line: -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6379 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
YCSB Client 0.17.0

Loading workload...
Starting test.
Maximum execution time specified as: 61 secs
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2024-10-03 02:27:55:245 0 sec: 0 operations; est completion in 0 second 
2024-10-03 02:28:05:081 10 sec: 83053 operations; 8305.3 current ops/sec; est completion in 14 hours 21 minutes [READ: Count=41444, Max=50239, Min=82, Avg=115.8, 90=131, 99=168, 99.9=581, 99.99=3145] [UPDATE: Count=41613, Max=9415, Min=81, Avg=113.96, 90=130, 99=174, 99.9=846, 99.99=3467] 
2024-10-03 02:28:15:081 20 sec: 172671 operations; 8961.8 current ops/sec; est completion in 13 hours 48 minutes [READ: Count=44775, Max=8863, Min=82, Avg=111.1, 90=128, 99=157, 99.9=229, 99.99=706] [UPDATE: Count=44839, Max=704, Min=79, Avg=108.24, 90=126, 99=154, 99.9=216, 99.99=434] 
2024-10-03 02:28:25:081 30 sec: 266118 operations; 9344.7 current ops/sec; est completion in 13 hours 26 minutes [READ: Count=46604, Max=5371, Min=78, Avg=106.73, 90=125, 99=144, 99.9=196, 99.99=481] [UPDATE: Count=46843, Max=449, Min=74, Avg=104.08, 90=122, 99=140, 99.9=181, 99.99=374] 
2024-10-03 02:28:35:081 40 sec: 361407 operations; 9528.9 current ops/sec; est completion in 13 hours 11 minutes [READ: Count=47550, Max=554, Min=77, Avg=104.57, 90=123, 99=140, 99.9=171, 99.99=336] [UPDATE: Count=47739, Max=6795, Min=74, Avg=102.36, 90=121, 99=137, 99.9=165, 99.99=438] 
2024-10-03 02:28:45:081 50 sec: 457078 operations; 9567.1 current ops/sec; est completion in 13 hours 2 minutes [READ: Count=47944, Max=404, Min=76, Avg=104.24, 90=124, 99=143, 99.9=195, 99.99=369] [UPDATE: Count=47727, Max=3029, Min=75, Avg=101.86, 90=121, 99=140, 99.9=184, 99.99=301] 
2024-10-03 02:28:55:081 60 sec: 552868 operations; 9579 current ops/sec; est completion in 12 hours 55 minutes [READ: Count=48081, Max=5803, Min=77, Avg=104.14, 90=122, 99=140, 99.9=177, 99.99=356] [UPDATE: Count=47709, Max=3537, Min=73, Avg=101.6, 90=120, 99=138, 99.9=174, 99.99=346] 
Maximum time elapsed. Requesting stop for the workload.
Stop requested for workload. Now Joining!
2024-10-03 02:28:56:093 61 sec: 562010 operations; 9042.53 current ops/sec; est completion in 12 hours 56 minutes [READ: Count=4553, Max=2593, Min=81, Avg=110.28, 90=130, 99=150, 99.9=197, 99.99=2593] [CLEANUP: Count=1, Max=1002, Min=1002, Avg=1002, 90=1002, 99=1002, 99.9=1002, 99.99=1002] [UPDATE: Count=4589, Max=569, Min=77, Avg=107.42, 90=128, 99=148, 99.9=181, 99.99=569] 
[OVERALL], RunTime(ms), 61015
[OVERALL], Throughput(ops/sec), 9211.013685159387
[TOTAL_GCS_Copy], Count, 52
[TOTAL_GC_TIME_Copy], Time(ms), 26
[TOTAL_GC_TIME_%_Copy], Time(%), 0.042612472342866504
[TOTAL_GCS_MarkSweepCompact], Count, 0
[TOTAL_GC_TIME_MarkSweepCompact], Time(ms), 0
[TOTAL_GC_TIME_%_MarkSweepCompact], Time(%), 0.0
[TOTAL_GCs], Count, 52
[TOTAL_GC_TIME], Time(ms), 26
[TOTAL_GC_TIME_%], Time(%), 0.042612472342866504
[READ], Operations, 280951
[READ], AverageLatency(us), 107.58965798306467
[READ], MinLatency(us), 76
[READ], MaxLatency(us), 50239
[READ], 95thPercentileLatency(us), 131
[READ], 99thPercentileLatency(us), 149
[READ], Return=OK, 280951
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1002.0
[CLEANUP], MinLatency(us), 1002
[CLEANUP], MaxLatency(us), 1002
[CLEANUP], 95thPercentileLatency(us), 1002
[CLEANUP], 99thPercentileLatency(us), 1002
[UPDATE], Operations, 281059
[UPDATE], AverageLatency(us), 105.17001056717629
[UPDATE], MinLatency(us), 73
[UPDATE], MaxLatency(us), 9415
[UPDATE], 95thPercentileLatency(us), 129
[UPDATE], 99thPercentileLatency(us), 148
[UPDATE], Return=OK, 281059
AUTOTEST_DONE